/*
<자료형과 변수>
*/

// 15 더하기 27
console.log(15 + 27);
// 17 빼기 33
console.log(17 - 33);
// 51 곱하기 2
// 32 나누기 7
// 77을 17로 나눈 나머지
// 위의 5가지를 복합 대입 연산자로 해보세요.
// 방금한 것을 문자열로 바꿔보세요.
// 자유롭게 문자열 하나를 변수에 대입해보세요.
// 그 문자열의 길이는?
// 그 문자열의 3번째 글자는 무엇인가요?
// 그 문자열의 마지막 글자를 숫자를 쓰지 않고 출력해보세요.
// 그 문자열에 “안녕"이라는 문자열이 포함되나요?
// 그 문자열의 5번째 글자부터 12번째 글자까지 출력해보세요.
// 문자열을 하나 더 만들어 변수에 대입해보고, 그 문자열과 첫번째 문자열을 합쳐보세요.
// 방금한 것을 두 가지 다른 방법으로 해보세요.
// 쉼표(,)로 단어들을 나열한 다음 배열로 바꿔보세요.
// 쉼표(,)로 단어들을 나열한 다음, 단어의 개수를 세어보세요.
// 배열을 하나 만들어 변수에 대입해 보세요
// 그 배열의 길이를 계산해보세요.
// 그 배열의 2번째 항목을 다른 것으로 바꿔보세요.
// 다른 방법으로 해보세요.
// 그 배열의 3번째 항목을 없애보세요.
// 그 배열의 2번째와 3번째 항목 사이에 다른 항목 3개를 넣어보세요.
// 그 배열의 마지막에 한 항목을 넣어보세요.
// 그 배열의 마지막 항목을 없애보세요.
// 그 배열의 첫번째 자리에 한 항목을 넣어보세요.
// 그 배열의 첫번째 항목을 없애보세요.
// 그 배열의 2번째부터 4번째 항목만 추출해보세요.
// 그 배열에 “포도"라는 항목이 포함되나요?
// “사과" 라는 단어를 포함한 문자열의 배열을 만들어 변수에 저장해보세요.
// “사과"는 몇번째에 있나요?
// 방금 만든 배열을 | 기호로 구분하여 하나의 문자열로 만들어보세요. (shift+백슬래시)
// 만들어본 두 배열을 합쳐보세요.
// 아래 모양을 가진 행렬을 배열로 표현해보세요. (행을 먼저 써보세요.)
// 위의 모양을 가진 행렬을 배열로 표현해보세요. (열을 먼저 써보세요.)
// name 이라는 key를 포함하는 객체를 하나 만들어 변수에 대입해보세요.
// 그 객체의 name 이라는 key의 value를 출력해보세요.
// 그 객체의 name 이라는 key의 value를 다른 것으로 바꿔보세요.
// 그 객체에는 어떤 key들이 있나요?
// 그 객체에는 어떤 value들이 있나요?
// 그 객체에 key와 value의 쌍은 몇개가 있나요?
// 같은 key들을 가진 객체를 두 개 더 만들고, 세 개의 객체를 하나의 배열로 만들어 변수에 대입해보세요.
// 방금 만든 객체들의 배열의 2번째 항목의 name 이라는 key의 value를 출력해 보세요.
// 5개의 key를 가진 객체를 하나 만들어 변수에 대입해 보는데, 모든 key의 value가 다른 자료형이 갖도록 해보세요.
// 그중 배열을 value로 갖는 key가 있을텐데, 그 항목의 배열의 길이를 출력해보세요.

/*
<조건문과 반복문>
*/

/*
<함수>
*/
